# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Install CLI Tools
## Shell Utilities
brew 'autojump'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'docker-compose'
brew 'youtube-dl'

## Network Utilities
brew 'htop'
brew 'nmap'
brew 'mtr'
brew 'wget'

## System Utilities
brew 'terminal-notifier'
brew 'tree'
brew 'mas'
brew 'trash'

## Dev Utilities
brew 'diff-so-fancy'
brew 'git'
brew 'gitmoji'
brew 'awscli'
brew 'n'

# Mac Apps
## Communication
cask 'slack'
cask 'skype'

## Productivity
cask 'alfred'
cask 'go2shell'
cask 'docker'
cask 'google-chrome'
cask 'rectangle'
cask 'clipy'

## System
cask 'the-unarchiver'
cask 'appcleaner'
cask 'namechanger'

## Editor
cask 'visual-studio-code'

## Development
cask 'diffmerge'
cask 'gpg-suite'
cask 'postman'
cask 'dbeaver-community'
cask 'sourcetree'

## Favourites
cask 'adobe-acrobat-reader'
cask 'expressvpn'
cask 'intellij-idea'
cask 'keepingyouawake'
cask 'lastpass'
cask 'microsoft-teams'
cask 'spotify'
cask 'tunnelblick'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-fira-code'

# App
mas 'XCode', id: 497799835
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Fantastical - Calendar & Tasks', id: 975937182
