# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'AdoptOpenJDK/openjdk'
tap 'hivemq/mqtt-cli'

# Install CLI Tools
## Shell Utilities
brew 'autojump'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'docker-compose'
brew 'youtube-dl'

## Network Utilities
brew 'htop'
brew 'nmap'
brew 'mtr'
brew 'wget'

## System Utilities
brew 'terminal-notifier'
brew 'tree'
brew 'mas'
brew 'trash'

## Dev Utilities
brew 'angular-cli'
brew 'awscli'
brew 'aws-cdk'
brew 'aws-elasticbeanstalk'
brew 'diff-so-fancy'
brew 'git'
brew 'gitmoji'
brew 'jenv'
brew 'mqtt-cli'
brew 'nvm'

# Mac Apps
## Communication
cask 'slack'
cask 'skype'

## Productivity
cask 'go2shell'
cask 'docker'
cask 'google-chrome'
cask 'rectangle'
cask 'clipy'

## System
cask 'the-unarchiver'
cask 'appcleaner'
cask 'namechanger'

## Editor
cask 'android-studio'
cask 'visual-studio-code'
cask 'apache-directory-studio'

## Development
cask 'adoptopenjdk8'
cask 'adoptopenjdk11'
cask 'adoptopenjdk15'
cask 'dbeaver-community'
cask 'diffmerge'
cask 'pingplotter'
cask 'postman'

## Favourites
cask 'adobe-acrobat-reader'
cask 'expressvpn'
cask 'intellij-idea'
cask 'keepingyouawake'
cask 'lastpass'
cask 'microsoft-teams'
cask 'spotify'
cask 'teamviewer'
cask 'tunnelblick'
cask 'ubersicht'
cask 'vlc'
cask 'webtorrent'
cask 'whatsapp'
cask 'zoom'

# Fonts
cask 'font-fira-code'

# App
mas 'XCode', id: 497799835
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Fantastical - Calendar & Tasks', id: 975937182
